In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
df=pd.DataFrame([['sonu',20,2000],['monu',21,19000]])
df=pd.DataFrame([['sonu',20,2000],['monu',21,19000]],index=['r1','r2'])
df=pd.DataFrame([['sonu',20,2000],['monu',21,19000]],index=['r1','r2'],columns=['name','age','sal'])
df

    name  age    sal
r1  sonu   20   2000
r2  monu   21  19000

In [10]:
df=pd.DataFrame({'empid':[1,3,6],'exp':[4,5,4]})
df

   empid  exp
0      1    4
1      3    5
2      6    4

In [11]:
ids=df['empid']

In [12]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [13]:
print(type(ids))

<class 'pandas.core.series.Series'>

In [14]:
ids

0    1
1    3
2    6
Name: empid, dtype: int64

In [16]:
df.shape

(3, 2)

In [17]:
df['name']=['a','b','c']

In [18]:
df

   empid  exp name
0      1    4    a
1      3    5    b
2      6    4    c

In [19]:
df['sal']=pd.Series([10000,12000,11000])

In [20]:
df

   empid  exp name    sal
0      1    4    a  10000
1      3    5    b  12000
2      6    4    c  11000

In [21]:
df['empid']=[101,201,301]

In [22]:
df

   empid  exp name    sal
0    101    4    a  10000
1    201    5    b  12000
2    301    4    c  11000

In [23]:
df.insert(1,'org',['o1','o2','o3'])

In [24]:
df

   empid org  exp name    sal
0    101  o1    4    a  10000
1    201  o2    5    b  12000
2    301  o3    4    c  11000

In [27]:
df.rename({'org':'organization'},axis=1,inplace=True)

In [28]:
df

   empid organization  exp name    sal
0    101           o1    4    a  10000
1    201           o2    5    b  12000
2    301           o3    4    c  11000

In [29]:
df.rename({0:'ducat'},axis=0)

       empid organization  exp name    sal
ducat    101           o1    4    a  10000
1        201           o2    5    b  12000
2        301           o3    4    c  11000

In [30]:
df.reindex(['empid','exp','name','sal','organization'],axis=1)

   empid  exp name    sal organization
0    101    4    a  10000           o1
1    201    5    b  12000           o2
2    301    4    c  11000           o3

In [32]:
df.reindex([2,0,1])

   empid organization  exp name    sal
2    301           o3    4    c  11000
0    101           o1    4    a  10000
1    201           o2    5    b  12000